Revit 2026 API

# CompoundStructureSetLayers Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayers(
	IList<CompoundStructureLayer> layers
)
```
```vb
Public Sub SetLayers (
	layers As IList(Of CompoundStructureLayer)
)
```
```cpp
public:
void SetLayers(
	IList<CompoundStructureLayer^>^ layers
)
```
```fsharp
member SetLayers :
        layers : IList<CompoundStructureLayer> -> unit
```

#### Parameters

layers IListCompoundStructureLayer

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace